Revit 2024 API
IndependentTag.MergeElbows Property
 Identifies if the leaders' elbows are merged or not. If they are are merged, all elbows are in the same point and they move together.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public bool MergeElbows { get; set; }
Visual Basic
Public Property MergeElbows As Boolean
	Get
	Set
Visual C++
public:
property bool MergeElbows {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The IndependentTag object does not have a tag behavior. -or- When setting this property: For this tag leaders are not allowed. -or- When setting this property: Can't merge elbows for tags that are part of a multi-reference annotation.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace